In [1]:
import pandas as pd
frame = pd.read_csv('untitled.txt',sep='\t',header =0)
frame

      Name       Birth       City  Position
0   Иванов  22.03.1980     Москва  Менеджер
1   Петров  07.08.1965     Казань  Менеджер
2  Сидоров  13.02.1980  Волгоград  Менеджер
3   Иванов  15.04.1985     Москва  Менеджер
4   Петров  19.11.1985      Питер  Менеджер
5  Сидоров  31.05.1985     Москва  Менеджер

In [2]:
frame.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

In [4]:
frame.Birth = frame.Birth.apply(pd.to_datetime)
frame

      Name      Birth       City  Position
0   Иванов 1980-03-22     Москва  Менеджер
1   Петров 1965-07-08     Казань  Менеджер
2  Сидоров 1980-02-13  Волгоград  Менеджер
3   Иванов 1985-04-15     Москва  Менеджер
4   Петров 1985-11-19      Питер  Менеджер
5  Сидоров 1985-05-31     Москва  Менеджер

In [5]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name        6 non-null object
Birth       6 non-null datetime64[ns]
City        6 non-null object
Position    6 non-null object
dtypes: datetime64[ns](1), object(3)
memory usage: 264.0+ bytes

In [6]:
frame.Position

0    Менеджер
1    Менеджер
2    Менеджер
3    Менеджер
4    Менеджер
5    Менеджер
Name: Position, dtype: object

In [10]:
frame[['Position']]

   Position
0  Менеджер
1  Менеджер
2  Менеджер
3  Менеджер
4  Менеджер
5  Менеджер

In [11]:
frame.head(3)

      Name      Birth       City  Position
0   Иванов 1980-03-22     Москва  Менеджер
1   Петров 1965-07-08     Казань  Менеджер
2  Сидоров 1980-02-13  Волгоград  Менеджер

In [12]:
frame[-3:]

      Name      Birth    City  Position
3   Иванов 1985-04-15  Москва  Менеджер
4   Петров 1985-11-19   Питер  Менеджер
5  Сидоров 1985-05-31  Москва  Менеджер

In [13]:
frame.loc[[1,3,5],['Name','City']]

      Name    City
1   Петров  Казань
3   Иванов  Москва
5  Сидоров  Москва